name = input("Введите имя")
famali = input("Введите фамилию")
age = input("Введите возраст")

# ИСПРАВИТЬ: вывод не соответствует требуемому формату
# ИСПРАВИТЬ: использование функции str() избыточно
print(name + " " + famali + ", " + str(age))
# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


# Введите имя Sasha
# Введите фамилию Ivanov
# Введите возраст99
#  Sasha  Ivanov, 99


# ИТОГ: 0/2


# КОММЕНТАРИЙ: PEP 8 — сборник рекомендаций по стилистическому оформлению Python кода — их стоит использовать для большего удобства чтения своего и чужого кода: https://peps.python.org/pep-0008/

